import os
import sys
script_dir = os.path.dirname(os.path.realpath(__file__))
sys.path.append(script_dir)
from typing import Literal
import json
import win32com.client
from datetime import datetime

def transpose(l:list):
    return [list(d) for d in zip(*l)]
    
if __name__ =="__main__":
    
    key_order=['개체',
    '줄기번호',
    '생장길이',
    '엽수',
    '엽장',
    '엽폭',
    '줄기굵기',
    '화방높이',
    '개화마디',
    '착과마디',
    '열매마디',
    '수확마디',
    '개화수',
    '착과수',
    '열매수',
    '수확수',]
    input_data="""[
        {
          "개체": 1,
          "개화마디": 3,
          "개화수": 1,
          "생장길이": 15.2,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 4,
          "엽장": 23.9,
          "엽폭": 14.4,
          "줄기굵기": 8.3,
          "줄기번호": 1,
          "착과마디": 3,
          "착과수": 1,
          "화방높이": 19.3
        },
        {
          "개체": 2,
          "개화마디": 4,
          "개화수": 1,
          "생장길이": 17.8,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 3,
          "열매수": 0,
          "엽수": 4,
          "엽장": 26.3,
          "엽폭": 13.5,
          "줄기굵기": 10.0,
          "줄기번호": 2,
          "착과마디": 4,
          "착과수": 2,
          "화방높이": 15.5
        },
        {
          "개체": 1,
          "개화마디": 4,
          "개화수": 1,
          "생장길이": 14.7,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 3,
          "열매수": 0,
          "엽수": 4,
          "엽장": 24.9,
          "엽폭": 15.3,
          "줄기굵기": 9.3,
          "줄기번호": 2,
          "착과마디": 4,
          "착과수": 1,
          "화방높이": 16.5
        },
        {
          "개체": 2,
          "개화마디": 4,
          "개화수": 2,
          "생장길이": 14.9,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 4,
          "엽장": 28.2,
          "엽폭": 15.4,
          "줄기굵기": 11.1,
          "줄기번호": 2,
          "착과마디": 2,
          "착과수": 1,
          "화방높이": 14.4
        },
        {
          "개체": 1,
          "개화마디": 3,
          "개화수": 1,
          "생장길이": 15.1,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 4,
          "엽장": 26.3,
          "엽폭": 15.2,
          "줄기굵기": 9.1,
          "줄기번호": 3,
          "착과마디": 3,
          "착과수": 1,
          "화방높이": 19.5
        },
        {
          "개체": 2,
          "개화마디": 3,
          "개화수": 2,
          "생장길이": 18.8,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 3,
          "엽장": 27.0,
          "엽폭": 16.7,
          "줄기굵기": 11.2,
          "줄기번호": 3,
          "착과마디": 3,
          "착과수": 1,
          "화방높이": 24.4
        },
        {
          "개체": 1,
          "개화마디": 3,
          "개화수": 1,
          "생장길이": 16.3,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 4,
          "엽장": 25.3,
          "엽폭": 14.5,
          "줄기굵기": 11.3,
          "줄기번호": 4,
          "착과마디": 3,
          "착과수": 1,
          "화방높이": 15.1
        },
        {
          "개체": 2,
          "개화마디": 3,
          "개화수": 1,
          "생장길이": 18.9,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 3,
          "엽장": 24.5,
          "엽폭": 13.3,
          "줄기굵기": 11.5,
          "줄기번호": 4,
          "착과마디": 3,
          "착과수": 1,
          "화방높이": 16.4
        },
        {
          "개체": 1,
          "개화마디": 3,
          "개화수": 1,
          "생장길이": 17.5,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 4,
          "엽장": 28.8,
          "엽폭": 17.5,
          "줄기굵기": 19.0,
          "줄기번호": 5,
          "착과마디": 3,
          "착과수": 1,
          "화방높이": 17.1
        },
        {
          "개체": 2,
          "개화마디": 3,
          "개화수": 1,
          "생장길이": 16.3,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 3,
          "엽장": 27.5,
          "엽폭": 15.9,
          "줄기굵기": 11.3,
          "줄기번호": 5,
          "착과마디": 3,
          "착과수": 1,
          "화방높이": 17.8
        },
        {
          "개체": 1,
          "개화마디": 3,
          "개화수": 2,
          "생장길이": 17.7,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 0,
          "열매수": 0,
          "엽수": 4,
          "엽장": 24.9,
          "엽폭": 14.9,
          "줄기굵기": 9.3,
          "줄기번호": 6,
          "착과마디": 0,
          "착과수": 2,
          "화방높이": 16.9
        },
        {
          "개체": 2,
          "개화마디": 3,
          "개화수": 1,
          "생장길이": 17.2,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 4,
          "엽장": 25.2,
          "엽폭": 15.5,
          "줄기굵기": 10.3,
          "줄기번호": 6,
          "착과마디": 0,
          "착과수": 1,
          "화방높이": 18.9
        },
        {
          "개체": 1,
          "개화마디": 3,
          "개화수": 1,
          "생장길이": 19.7,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 4,
          "엽장": 22.1,
          "엽폭": 13.0,
          "줄기굵기": 19.1,
          "줄기번호": 7,
          "착과마디": 0,
          "착과수": 1,
          "화방높이": 23.4
        },
        {
          "개체": 2,
          "개화마디": 3,
          "개화수": 1,
          "생장길이": 16.8,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 3,
          "엽장": 26.3,
          "엽폭": 17.8,
          "줄기굵기": 11.5,
          "줄기번호": 7,
          "착과마디": 0,
          "착과수": 1,
          "화방높이": 24.4
        },
        {
          "개체": 1,
          "개화마디": 4,
          "개화수": 0,
          "생장길이": 14.7,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 3,
          "열매수": 0,
          "엽수": 4,
          "엽장": 22.1,
          "엽폭": 12.8,
          "줄기굵기": 8.1,
          "줄기번호": 8,
          "착과마디": 2,
          "착과수": 1,
          "화방높이": 13.2
        },
        {
          "개체": 2,
          "개화마디": 3,
          "개화수": 0,
          "생장길이": 17.8,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 4,
          "엽장": 27.4,
          "엽폭": 14.9,
          "줄기굵기": 10.9,
          "줄기번호": 8,
          "착과마디": 0,
          "착과수": 1,
          "화방높이": 21.0
        },
        {
          "개체": 1,
          "개화마디": 0,
          "개화수": 2,
          "생장길이": 20.5,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 3,
          "열매수": 0,
          "엽수": 4,
          "엽장": 28.3,
          "엽폭": 17.3,
          "줄기굵기": 9.3,
          "줄기번호": 9,
          "착과마디": 0,
          "착과수": 1,
          "화방높이": 21.8
        },
        {
          "개체": 2,
          "개화마디": 0,
          "개화수": 0,
          "생장길이": 19.2,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 3,
          "열매수": 0,
          "엽수": 4,
          "엽장": 28.5,
          "엽폭": 17.2,
          "줄기굵기": 11.3,
          "줄기번호": 9,
          "착과마디": 0,
          "착과수": 2,
          "화방높이": 24.4
        },
        {
          "개체": 1,
          "개화마디": 3,
          "개화수": 0,
          "생장길이": 16.8,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 2,
          "열매수": 0,
          "엽수": 5,
          "엽장": 28.3,
          "엽폭": 14.3,
          "줄기굵기": 11.0,
          "줄기번호": 10,
          "착과마디": 0,
          "착과수": 1,
          "화방높이": 23.5
        },
        {
          "개체": 2,
          "개화마디": 3,
          "개화수": 0,
          "생장길이": 18.2,
          "수확마디": 0,
          "수확수": 0,
          "열매마디": 0,
          "열매수": 0,
          "엽수": 5,
          "엽장": 27.5,
          "엽폭": 17.5,
          "줄기굵기": 10.5,
          "줄기번호": 10,
          "착과마디": 0,
          "착과수": 2,
          "화방높이": 19.4
        }
      ]"""
    file_path="D:/Desktop/출장/20250331_3조_원준용_홍승표/20250331_3조_생육원본/25년_파프리카_생육원본_김관섭.xlsm"
    farm_name="김관섭"
    last_date="2025-03-24"
    date="2025-03-31"
    data=json.loads(input_data)
    keys = data[0].keys()
    data = [[d.get(key, None) for key in key_order] for d in data] 
    excel = win32com.client.Dispatch("Excel.Application")
    excel.Visible=True
    num_entity=len(data)
    workbook = excel.Workbooks.Open(file_path)
    ws=workbook.Sheets("생육조사")
    used_range = ws.UsedRange  # 사용된 범위 가져오기
    rows = used_range.Rows.Count
    data = transpose(data)
    data.insert(0, ["=농가정보!$C$7"]*num_entity)
    data.insert(1, [date]*num_entity)
    # data.insert(4, [1]*self.num_entity)
    last_data=None
    write_row=excel.Application.WorksheetFunction.CountA(ws.Range(ws.Cells(1, 2), ws.Cells(rows, 2)))+1
    
    last_datas=ws.Range(ws.Cells(2, 2), ws.Cells(rows, 2))
    
    last_datas=last_datas.Value
    ws.Cells(1,1).Value="text"
    last_date = datetime.strptime(last_date, "%Y-%m-%d").date()
    
    for row, v in enumerate(last_datas, start=2):
        if not v[0] or isinstance(v[0], str):
            continue
        date=v[0].date()
        try:
            if last_date == date:
                write_row=row+num_entity
                lastdata=ws.Range(ws.Cells(row, 1), ws.Cells(row+num_entity-1, 1)).Value
                last_data= [list(rows) for rows in lastdata]
                last_data=[[0 if x is None else x for x in row] for row in last_data]
                break
        except TypeError:
            print(f"오류: 날짜 형식이 올바르지 않습니다.")
    if last_data:
        length_data=[f"=E{str(int(write_row)+r-num_entity)}+[@생장길이]" for r in range(num_entity)]
        data.insert(4, length_data)
    else:
        length_data=[""]*num_entity
        data.insert(5, length_data)
    data.insert(11, ["본주"]*num_entity)
    data = transpose(data)
    ws.Range(ws.Cells(write_row, 1), ws.Cells(write_row+len(data)-1, 1+len(data[0])-1)).Value=data
    workbook.Save()
